<?php
//Вывести на экран всех пользователей в массиве
$arr = ['Petr', 'Alex', 'Jon', 'Jeck'];

// Добавим в массив динамически
// так $arr[] = 'Mia', Mia добавиться в конец массива
// или $arr[10] = 'Mia2', Mia2 добавиться с ключом 10
$arr[] = 'Mia';

for ($i = 0; $i <= count($arr); $i++) {
    echo $arr[$i] . "<br>";
}

//=================================================
// Задание тоже, но только с ассоциативным массивом
$names = [
    'Petr' => 'Petrov',
    'Alex' => 'Alexov',
    'Jon' => 'Jonov',
];

// НИКАК!!! Только с помощью foreach

//=================================================
// Цикл for не подойдёт, когда ключи идут непопорядку. Только с помощью foreach

//=================================================
// Таблица умножения
echo "<table border='1'>\n";
for ($i = 1; $i <= 9; $i++) {
    echo "\t<tr>\n";
    for ($j = 1; $j <= 9; $j++) {
        echo "\t\t<td>$i * $j = ".$i * $j."</td>\n";
    }
    echo "\t</tr>\n";
}
echo "</table>\n";